---
kind: method
id: M:Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/5c8ec772-b72c-ded9-9eb5-d6e1a55877c3.htm
---
# Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.